# =============================================================
# Задача №4. Напишите программу, которая будет
# преобразовывать десятичное число в двоичное.
# =============================================================

s = ""
n = int(input("Введите число в десятичной системе:\n"))
while n != 0:
    s = str(n % 2) + s
    n //= 2
print(f"Это число в двоичной системе:\n{s}")
